src/DataProcessors/РаспределениеПоставокПоЗаказамПоставщикам/РаспределениеПоставокПоЗаказамПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеПоставокПоЗаказамПоставщикам</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределённыеМПЗ</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеМПЗПрочее</name>
      <type>
        <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПоступлениеМПЗПрочее/ПоступлениеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РаспределениеПоставокПоЗаказамПоставщикам/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Наименование,Количество,Цена)
МПЗ = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
	ТЧ = Объект.ТабличнаяЧасть.Добавить(); 
	ТЧ.МПЗ = МПЗ;
 	ТЧ.Количество = Количество;
 	ТЧ.Цена = Цена; 
	Иначе
    Сообщить(Наименование+" не найден в справочнике материалов!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда	
		Если Вопрос("Очистить табличную часть перед загрузкой?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.ТабличнаяЧасть.Очистить();
		КонецЕсли; 
	КонецЕсли; 
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл со списком МПЗ");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка cписка МПЗ из файла..."); 
        ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СозданиеТаблицыНезакрытыхЗаказовПоставщику()
Запрос = Новый Запрос;
СписокМПЗ = Новый СписокЗначений;

	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	СписокМПЗ.Добавить(ТЧ.МПЗ);
	КонецЦикла;
ТаблицаЗаказов.Очистить(); 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.МПЗ,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.Контрагент = &Контрагент
	|	И ЗаказыПоставщикамОстатки.Договор = &Договор
	|	И ЗаказыПоставщикамОстатки.МПЗ В(&СписокМПЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата";
Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
Запрос.УстановитьПараметр("Договор", Объект.Договор);
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаЗаказов.Добавить();
	ТЧ.ЗаказПоставщику = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
Объект.РаспределённыеМПЗ.Очистить();
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		Если ТЧ.Количество = 0 Тогда
		Продолжить;
		КонецЕсли; 
	НераспределённыйОстаток = ТЧ.Количество;
	ВыборкаЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));
		Если ВыборкаЗаказов.Количество() > 0 Тогда
			Для к = 0 по ВыборкаЗаказов.Количество()-1 Цикл
			Заказ = ВыборкаЗаказов[к];	
				Если Заказ.Остаток >= НераспределённыйОстаток Тогда
				Заказ.Остаток = Заказ.Остаток - НераспределённыйОстаток;
				ТЧ_МПЗ = Объект.РаспределённыеМПЗ.Добавить();
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = НераспределённыйОстаток;
				ТЧ_МПЗ.Цена = ТЧ.Цена;
				ТЧ_МПЗ.ЗаказПоставщику = Заказ.ЗаказПоставщику;
				ТЧ.Остаток = 0;
				Прервать;
				ИначеЕсли Заказ.Остаток > 0 Тогда
				КолВЗаказе = Заказ.Остаток;
				НераспределённыйОстаток = НераспределённыйОстаток - КолВЗаказе;			
				Заказ.Остаток = 0;
				ТЧ_МПЗ = Объект.РаспределённыеМПЗ.Добавить();
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = КолВЗаказе;
				ТЧ_МПЗ.Цена = ТЧ.Цена;
				ТЧ_МПЗ.ЗаказПоставщику = Заказ.ЗаказПоставщику;
				ТЧ.Остаток = НераспределённыйОстаток;
				КонецЕсли; 
			КонецЦикла;
		Иначе
		ТЧ.Остаток = НераспределённыйОстаток;
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Создание таблицы незакрытых заказов поставщику...");
	СозданиеТаблицыНезакрытыхЗаказовПоставщику();
	Состояние("Обработка...",,"Распределение МПЗ по заказам поставщикам...");	
	РаспределитьНаСервере();
		Если Элементы.ТабличнаяЧасть.ТекущаяСтрока <> Неопределено Тогда
		Элементы.РаспределённыеМПЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("МПЗ", Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
	Элементы.РаспределённыеМПЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("МПЗ", Элемент.ТекущиеДанные.МПЗ); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьРаспределённыеМПЗ(МПЗ)
МассивСтрок = Объект.РаспределённыеМПЗ.НайтиСтроки(Новый Структура("МПЗ",МПЗ)); 
	Для каждого Стр Из МассивСтрок Цикл 
	Объект.РаспределённыеМПЗ.Удалить(Стр); 
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалением(Элемент, Отказ)
УдалитьРаспределённыеМПЗ(Элемент.ТекущиеДанные.МПЗ);
КонецПроцедуры

&НаСервере
Функция СоздатьДокумент(ЗаказПоставщику,ТЗ)
	Попытка
	ПоступлениеПрочее = Документы.ПоступлениеМПЗПрочее.СоздатьДокумент();
	ПоступлениеПрочее.Дата = ТекущаяДата();
	ПоступлениеПрочее.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеПрочее.ДокументОснование = ЗаказПоставщику;	
	ПоступлениеПрочее.Подразделение = Объект.МестоХранения.Подразделение;
	ПоступлениеПрочее.УстановитьНовыйНомер(ПрисвоитьПрефикс(Объект.МестоХранения.Подразделение));
	ПоступлениеПрочее.МестоХранения = Объект.МестоХранения;
	ПоступлениеПрочее.Статья = Объект.Статья;
	ПоступлениеПрочее.НомерИсходногоДокумента = СокрЛП(Объект.НомерДокВходящий);
		Если Значениезаполнено(Объект.НомерДокВходящий) Тогда
		ПоступлениеПрочее.Комментарий = СокрЛП(Объект.НомерДокВходящий) + " от "+Объект.ДатаДокВходящий;
		КонецЕсли; 
			Для каждого ТЧ Из ТЗ Цикл
			ТЧПП = ПоступлениеПрочее.ТабличнаяЧасть.Добавить();
			ТЧПП.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			ТЧПП.МПЗ = ТЧ.МПЗ;	
			ТЧПП.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(ТЧ.МПЗ);
			ТЧПП.Количество = ТЧ.Количество;
			ТЧПП.Цена = ТЧ.Цена;
			КонецЦикла;	
    ПоступлениеПрочее.Записать(РежимЗаписиДокумента.Проведение);
	Возврат(ПоступлениеПрочее.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
ТЗ = Новый ТаблицаЗначений;
СЗ = Новый СписокЗначений;

ТЗ.Колонки.Добавить("Идентификатор");
ТЗ.Колонки.Добавить("МПЗ");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");

Объект.РаспределённыеМПЗ.Сортировать("ЗаказПоставщику,МПЗ");
ТекЗаказ = Неопределено;
	Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл	
		Если ТекЗаказ <> ТЧ.ЗаказПоставщику Тогда
			Если ТекЗаказ <> Неопределено Тогда
			Результат = СоздатьДокумент(ТекЗаказ,ТЗ);
				Если Результат <> Неопределено Тогда
					Для Каждого ТЧ_ТЗ Из ТЗ Цикл	
					Стр = Объект.РаспределённыеМПЗ.НайтиПоИдентификатору(ТЧ_ТЗ.Идентификатор);
					Стр.ПоступлениеМПЗПрочее = Результат;
					КонецЦикла; 			
				КонецЕсли;
			ТЗ.Очистить();
			КонецЕсли;
		ТекЗаказ = ТЧ.ЗаказПоставщику;
		КонецЕсли; 
	ТЧ_МПЗ = ТЗ.Добавить();
	ТЧ_МПЗ.Идентификатор = ТЧ.ПолучитьИдентификатор();
	ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
	ТЧ_МПЗ.Количество = ТЧ.Количество;
	ТЧ_МПЗ.Цена = ТЧ.Цена;
	КонецЦикла;
		Если ТекЗаказ <> Неопределено Тогда	
		Результат = СоздатьДокумент(ТекЗаказ,ТЗ);
			Если Результат <> Неопределено Тогда
				Для Каждого ТЧ_ТЗ Из ТЗ Цикл	
				Стр = Объект.РаспределённыеМПЗ.НайтиПоИдентификатору(ТЧ_ТЗ.Идентификатор);
				Стр.ПоступлениеМПЗПрочее = Результат;
				КонецЦикла;			
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда) 
СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоМПЗ(МПЗ)
КоличествоИтого = 0;
	Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл
		Если ТЧ.МПЗ = МПЗ Тогда	
		КоличествоИтого = КоличествоИтого + ТЧ.Количество;
		КонецЕсли; 
	КонецЦикла;
Возврат(КоличествоИтого);
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблДокумент = Макет.ПолучитьОбласть("Документ");
ОблКонец = Макет.ПолучитьОбласть("Конец");
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ_МПЗ Из Объект.ТабличнаяЧасть Цикл
	ОблМПЗ.Параметры.МПЗ = ТЧ_МПЗ.МПЗ;
	ОблМПЗ.Параметры.Количество = ПолучитьКоличествоМПЗ(ТЧ_МПЗ.МПЗ);
	ТабДок.Вывести(ОблМПЗ);
		Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл
			Если ТЧ_МПЗ.МПЗ = ТЧ.МПЗ Тогда	
			ОблДокумент.Параметры.ЗаказПоставщику = ТЧ.ЗаказПоставщику;
			ОблДокумент.Параметры.Количество = ТЧ.Количество;
			ОблДокумент.Параметры.ПоступлениеМПЗПрочее = ТЧ.ПоступлениеМПЗПрочее;
			ТабДок.Вывести(ОблДокумент); 
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
ОблКонец.Параметры.Количество = Объект.РаспределённыеМПЗ.Итог("Количество");
ТабДок.Вывести(ОблКонец);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
ТД = ПечатьНаСервере();
ТД.Показать("Распределение поставок по заказам поставщикам");
КонецПроцедуры
